{
  "resume":{
    "name":"Ian Dexter D. Marquez",
    "title":"Linux system administrator",
    "contact":{
      "home":[
        "26 Dona Narcisa Avenue, Kapitan Pepe Subdivision, 3100 Cabanatuan City PHILIPPINES",
        "37 Pvt Aurellana St, Bagong Ilog, 1600 Pasig City PHILIPPINES"
      ],
      "email":[
        "im@iandexter.net"
      ],
      "web":[
        {
          "link":"http://www.iandexter.net",
          "title":"Launch page"
        }
      ],
      "phone":[
        "+63 917 887 6260"
      ]
    },
    "summary":"With more than 10 years extensive experience in administering Linux and Unix platforms. Develops and maintains various automation tools for infrastructure management and application deployment. Collaborates with global software development and operations teams in application delivery and support. Certified in Red Hat Enterprise Linux, Microsoft Windows, and ITIL Foundation in IT Service Management.",
    "overview":{
      "interests":[
        "DevOps",
        "PaaS, IaaS",
        "OpenShift, OpenStack, Google App Engine"
      ],
      "skills":[
        {
          "area":"Unix/Linux systems administration",
          "years":10,
          "proficiency":"advanced"
        },
        {
          "area":"Infrastructure automation",
          "years":2,
          "proficiency":"proficient"
        },
        {
          "area":"Application deployment and support",
          "years":6,
          "proficiency":"advanced"
        },
        {
          "area":"Network design, development and administration",
          "years":5,
          "proficiency":"proficient"
        },
        {
          "area":"Web design, development and management",
          "years":3,
          "proficiency":"proficient"
        },
        {
          "area":"Identity management",
          "years":2,
          "proficiency":"proficient"
        }
      ],
      "languages":[
        {
          "language":"Bash/Shell",
          "years":10,
          "proficiency":"advanced"
        },
        {
          "language":"Perl",
          "years":5,
          "proficiency":"proficient"
        },
        {
          "language":"PHP",
          "years":3,
          "proficiency":"proficient"
        },
        {
          "language":"Python",
          "years":2,
          "proficiency":"proficient"
        },
        {
          "language":"SQL",
          "years":2,
          "proficiency":"proficient"
        },
        {
          "language":"Javascript",
          "years":3,
          "proficiency":"proficient"
        }
      ],
      "platforms":[
        {
          "platform":"Red Hat Enterprise Linux, CentOS, Fedora",
          "years":10,
          "proficiency":"advanced"
        },
        {
          "platform":"SuSE Linux Enterprise Server",
          "years":3,
          "proficiency":"advanced"
        },
        {
          "platform":"Ubuntu, Debian",
          "years":2,
          "proficiency":"proficient"
        },
        {
          "platform":"Sun Solaris, IBM AIX",
          "years":1,
          "proficiency":"basic"
        },
        {
          "platform":"Microsoft Windows 2003 Server",
          "years":1,
          "proficiency":"basic"
        }
      ],
      "tools":[
        {
          "name":"Network and systems administration",
          "tools":[
            {
              "tool":"Ansible, Puppet",
              "years":1,
              "proficiency":"basic"
            },
            {
              "tool":"Nagios, NetCool",
              "years":5,
              "proficiency":"advanced"
            },
            {
              "tool":"Apache, Tomcat, Squid",
              "years":10,
              "proficiency":"advanced"
            },
            {
              "tool":"Postfix, Sendmail, Courier, Dovecot, Procmail",
              "years":10,
              "proficiency":"advanced"
            },
            {
              "tool":"MySQL, PostgreSQL, Sybase, Oracle",
              "years":5,
              "proficiency":"proficient"
            },
            {
              "tool":"Trend Micro InterScan Web and Messaging Security Suite for Windows and Unix",
              "years":1,
              "proficiency":"proficient"
            },
            {
              "tool":"Ethereal/Wireshark, Sniffer, tcpdump",
              "years":5,
              "proficiency":"proficient"
            },
            {
              "tool":"Cisco IOS, F5 BIG-IP ZebOS",
              "years":2,
              "proficiency":"proficient"
            },
            {
              "tool":"VMware, VirtualBox",
              "years":6,
              "proficiency":"proficient"
            },
            {
              "tool":"Subversion, git",
              "years":5,
              "proficiency":"proficient"
            },
            {
              "tool":"Amazon Web Services, OpenShift, OpenStack, Google App Engine",
              "years":1,
              "proficiency":"basic"
            }
          ]
        },
        {
          "name":"Identity management",
          "tools":[
            {
              "tool":"Sun Directory Server",
              "years":2,
              "proficiency":"proficient"
            },
            {
              "tool":"Sun Identity Manager",
              "years":2,
              "proficiency":"proficient"
            }
          ]
        },
        {
          "name":"Web and content development",
          "tools":[
            {
              "tool":"Drupal, WordPress",
              "years":5,
              "proficiency":"proficient"
            },
            {
              "tool":"TWiki, MediaWiki, Dokuwiki",
              "years":5,
              "proficiency":"proficient"
            }
          ]
        }
      ]
    },
    "experience":[
      {
        "title":"Linux system administrator",
        "start":"April 2010",
        "end":"present",
        "organization":{
          "name":"Asian Development Bank",
          "link":"http://www.adb.org/",
          "location":"Pasig City",
          "under":"RCG IT, Inc.",
          "description":"The Asian Development Bank is a multilateral financial institution that provides technical and financial assistance to developing countries."
        },
        "summary":"Develops and maintains automation tools for managing the Unix infrastructure for the Bank's mission-critical applications like ERP, data warehousing, financials, and business intelligence.",
        "tasks":[
          "Provides platform-level support to the Bank's development and infrastructure operations teams.",
          "Coordinates with various software development teams for continuous integration, rapid deployment, performance monitoring and tuning, and application support.",
          "Develops and maintains tools for application deployment, monitoring, and performance tuning.",
          "Documents testing and deployment scenarios for the Unix infrastructure requirements of the Bank.",
          "Supports Unix servers that run Apache, Tomcat and WebSphere web servers, Oracle and MySQL database servers, Oracle ERP applications, and IBM business intelligence software."
        ],
        "accomplishments":[
          "Maintains an automation script for deploying Oracle applications that streamlines the development process. The deployment script, used within the Oracle web UI, was not actively maintained, and with numerous feature requests and issues submitted by the development teams. Upon assumption of code maintenance, the feature requests and bugs have been reduced to less than 10%.",
          "Wrote an orchestration tool that provides 'self-service' capabilities for tasks such as database and application server restarts, log retrieval, initiation of cold backups, among others. Commonly requested tasks had to go through the service request queues before being acted on. The tool significantly decreased these requests from development and operations teams, improving their own workflows.",
          "Streamlined the provisioning process for Linux (physical and virtual) servers, which reduced build times from one day to less than hour.",
          "Automated the security baseline configuration for Linux servers as part of compliance requirements for the Bank. Quarterly security audits tended to be time-consuming exercises for administrators. The automation process helped decrease the number of audit findings and interventions by more than 60%.",
          "Created and deployed a management tool for setting scheduled jobs from a centralized repository. Scheduled jobs were previously stored and managed locally. With the sync tool, jobs were centrally managed from a source code repository, and pulled by the corresponding servers, thus improving the scheduling workflow and minimizing errors. This project was accepted in the [League of Professional System Administrators (LOPSA) Mentorship Program](https://lopsa.org/mentor).",
          "Re-factored a service that routes SMS acknowledgements for Nagios alerts. The previous service was not capable of accepting alert acknowledgements through SMS. The new service resulted in higher response times from different operations teams when acting on service alerts.",
          "Writes and maintains various scripts in Perl, Python and Bash for automating system administration, performance monitoring, and tuning tasks.",
          "As subject-matter expert, provides quality control and source code review for automation tools and scripts used in the Unix infrastructure.",
          "Current project: a simple RESTful API for retrieving objects from a configuration management tool. The API will be used to expose server configuration items in a dashboard tool."
        ],
        "areas":[
          "Application deployment and support",
          "DevOps",
          "IaaS",
          "Infrastructure automation",
          "PaaS",
          "Unix/Linux systems administration",
          "Web design, development and management"
        ],
        "languages":[
          "Bash/Shell",
          "PHP",
          "Perl",
          "Python",
          "SQL"
        ],
        "platforms":[
          "IBM AIX",
          "Red Hat Enterprise Linux",
          "SuSE Linux Enterprise Server",
          "Sun Solaris"
        ],
        "tools":[
          "Ansible",
          "Apache",
          "Ethereal/Wireshark",
          "MySQL",
          "Nagios",
          "Oracle",
          "Postfix",
          "Procmail",
          "Puppet",
          "Sendmail",
          "Subversion",
          "Tomcat",
          "VMware",
          "VirtualBox",
          "git",
          "tcpdump"
        ]
      },
      {
        "title":"Senior software engineer",
        "start":"May 2007",
        "end":"April 2010",
        "organization":{
          "name":"Accenture, Inc.",
          "link":"http://www.accenture.com",
          "location":"Pasig City",
          "under":"",
          "description":"Accenture is an industry leader in global management consulting, technology services, and outsourcing."
        },
        "summary":"Supported the global identity management and web infrastructure of a leading financial services firm.",
        "tasks":[
          "Maintained the firm's directory services and identity management infrastructure using third-party open source and internally developed tools.",
          "Supported the firm's global web and enterprise products infrastructure.",
          "Worked closely with global software development teams in the areas of application deployment, monitoing and support.",
          "Resolved infrastructure issues reported through automated alerts and from the global help desk."
        ],
        "accomplishments":[
          "Subject-matter expert and training resource for shell scripting and Linux administration.",
          "Created a web application that interfaced with a service fulfillment facility. The application significantly streamlined the creation and closure of service requests for common tasks.",
          "Wrote and maintained various scripts to automate administrative tasks, including a tool for group management notification, a helper script that gathers LDAP information from various sources, and checkout scripts that provide inputs for the global monitoring framework."
        ],
        "areas":[
          "Application deployment and support",
          "Identity management",
          "Web design, development and management"
        ],
        "languages":[
          "Bash/Shell",
          "Perl",
          "SQL"
        ],
        "platforms":[
          "Red Hat Enterprise Linux",
          "Sun Solaris"
        ],
        "tools":[
          "Apache",
          "Cisco IOS",
          "F5 BIG-IP ZebOS",
          "NetCool",
          "Sun Directory Server",
          "Sun Identity Manager",
          "Sybase",
          "TWiki",
          "Tomcat"
        ]
      },
      {
        "title":"Unix system administrator",
        "start":"January 2007",
        "end":"April 2007",
        "organization":{
          "name":"Asian Development Bank",
          "link":"http://www.adb.org",
          "location":"Pasig City",
          "under":"Cytronics, Inc.",
          "description":"The Asian Development Bank is a multilateral financial institution that provides technical and financial assistance to developing countries."
        },
        "summary":"Operated and maintained Unix servers in the Bank's data center.",
        "tasks":[
          "Ensured 99.999% uptime of development, staging and production Unix (Solaris, AIX, and SLES) servers in the Bank's data center."
        ],
        "accomplishments":[
          "Projects included the deployment of Subversion repositories for more than 20 software development projects; server consolidation; staging and installation of centralized log servers for Unix and Windows platforms; and testing and deployment of server backup strategies (on SAN) for about 100 Unix servers."
        ],
        "areas":[
          "Unix/Linux systems administration"
        ],
        "languages":[
          "Bash/Shell",
          "Perl",
          "SQL"
        ],
        "platforms":[
          "IBM AIX",
          "Red Hat Enterprise Linux",
          "SuSE Linux Enterprise Server"
        ],
        "tools":[
          "Apache",
          "Oracle",
          "Subversion",
          "Tomcat",
          "VMware"
        ]
      },
      {
        "title":"Systems engineer",
        "start":"April 2006",
        "end":"January 2007",
        "organization":{
          "name":"Trend Micro, Inc.",
          "link":"http://www.trendmicro.com",
          "location":"Quezon City",
          "under":"",
          "description":"Trend Micro is a global leader in anti-virus and security solutions, providing comprehensive enterprise-level services across multiple platforms and customer segments."
        },
        "summary":"Provided intermediate-level technical and engineering support for Trend Micro enterprise products as part of its EMEA Technical Support Center infrastructure.",
        "tasks":[
          "Handled troubleshooting and technical issue resolution for internet gateway (web and messaging) security products on Windows, Solaris and Linux platforms, using intensive testing procedures and set-up of lab environments for simulations and software patch testing.",
          "Initiated customer recovery procedures through teleconferences and web-based live meetings with senior product specialists and developers."
        ],
        "accomplishments":[
          "Performed beta testing and technical documentation of upcoming products such as network appliances and gateway security software.",
          "Acted as a subject-matter resource on Linux and systems administration, and provided technical coaching for new engineers.",
          "Contributed technical solutions articles to Trend Micro's knowledge base."
        ],
        "areas":[
          ""
        ],
        "languages":[
          "Bash/Shell",
          "Perl"
        ],
        "platforms":[
          "CentOS",
          "Microsoft Windows 2003 Server",
          "Red Hat Enterprise Linux",
          "Sun Solaris"
        ],
        "tools":[
          "Ethereal/Wireshark",
          "Postfix",
          "PostgreSQL",
          "Sendmail",
          "Sniffer",
          "Squid",
          "Trend Micro InterScan Web and Messaging Security Suite for Windows and Unix",
          "VMware",
          "tcpdump"
        ]
      },
      {
        "title":"Linux and web administrator",
        "start":"July 2004",
        "end":"March 2006",
        "organization":{
          "name":"Philippine Rice Research Institute",
          "link":"http://www.philrice.gov.ph",
          "location":"Science City of Mu&ntilde;oz",
          "under":"",
          "description":"The Philippine Rice Research Institute is a premier research and development facility in Asia that pioneers and promotes rice science and technology."
        },
        "summary":"Managed Linux servers of the corporate intranet in the local and wide area networks, and numerous web-based services for the Institute. Developed a portal for the Open Academy for Philippine Agriculture, the [Pinoy Farmers' Internet](http://www.openacademy.ph).",
        "tasks":[
          "Managed Linux systems (on Red Hat, Fedora and CentOS) with services such as DNS, IMAP, LDAP, proxy, database, and HTTP.",
          "Developed and maintained the web portal for the Pinoy Farmers' Internet."
        ],
        "accomplishments":[
          "Successfully deployed a 30-node Linux Terminal Server Project (LTSP) site running Ubuntu Linux as the IT training lab for the PhilRice Biotechnology Intellectual Property Rights Center.",
          "Deployed and maintained the Farmers' Contact Center web application in collaboration with the DOST Advanced Science and Technology Institute (ASTI). With the app, farmers and agricultural extension workers can send queries, and receive tips through SMS.",
          "As a science research specialist, performed research on the evaluation and usability of learning management and content delivery systems for agriculture extension workers; and the evaluation and installation of a content management system for the corporate intranet and the web portal. These studies were presented and gained recognition in various scientific research fora.",
          "Other projects: configuration, deployment and maintenance of redundant database servers with high-availability and fail-over; high-availability and load-balancing clusters for WAN routers and local web proxy caches; improved network security through reformulation and implementation of network policies; and migration from proprietary software to open source."
        ],
        "areas":[
          "Network design, development and administration",
          "Unix/Linux systems administration",
          "Web design, development and management"
        ],
        "languages":[
          "Bash/Shell",
          "Javascript",
          "PHP",
          "Perl",
          "SQL"
        ],
        "platforms":[
          "CentOS",
          "Fedora",
          "Red Hat Enterprise Linux",
          "Ubuntu"
        ],
        "tools":[
          "Apache",
          "Cisco IOS",
          "Courier",
          "Debian",
          "Dokuwiki",
          "Dovecot",
          "Drupal",
          "Ethereal/Wireshark",
          "MediaWiki",
          "MySQL",
          "Postfix",
          "PostgreSQL",
          "Procmail",
          "Sendmail",
          "Squid",
          "Tomcat",
          "WordPress"
        ]
      },
      {
        "title":"Network administrator",
        "start":"April 2002",
        "end":"July 2004",
        "organization":{
          "name":"National Irrigation Administration",
          "link":"http://www.nia.gov.ph",
          "location":"Quezon City",
          "under":"",
          "description":"The National Irrigation Administration is the lead Philippine agency that provides irrigation services, development, operation and maintenance."
        },
        "summary":"Designed and implemented the NIA Central Office local area network, and implemented services such as Active Directory, intranet, web, e-mail, and instant messaging.",
        "tasks":[
          ""
        ],
        "accomplishments":[
          "Initiated the partnership between the NIA and PREGINET of DOST ASTI for the Agency's inclusion to the nationwide broadband research and education network.",
          "Designed, prepared bid documents and specifications, and managed the structured cabling project of the NIA CO LAN.",
          "Developed the roll-out and implementation strategy for the NIA CO LAN.",
          "Developed and maintained the company intranet using Apache, PHP and MySQL, with a content management system running on Drupal."
        ],
        "areas":[
          "Network design, development and administration"
        ],
        "languages":[
          "Bash/Shell",
          "Javascript",
          "PHP",
          "SQL"
        ],
        "platforms":[
          "Fedora",
          "Red Hat Enterprise Linux"
        ],
        "tools":[
          "Apache",
          "Drupal",
          "Ethereal/Wireshark",
          "MySQL",
          "Sniffer",
          "Squid"
        ]
      },
      {
        "title":"Community relations / information assistant",
        "start":"February 1999",
        "end":"March 2002",
        "organization":{
          "name":"National Irrigation Administration",
          "link":"",
          "location":"Science City of Mu&ntilde;oz",
          "under":"",
          "description":"The CMIPP is NIA's flagship project that provide irrigation services to northern Central Luzon and supplementary power to the Luzon grid of the National Power Corporation."
        },
        "summary":"Implemented the public information infrastructure for the Casecnan Multipurpose Irrigation and Power Project (CMIPP), and frequently assigned to IT-related activities.",
        "tasks":[
          "Designed and developed information materials such as stand-alone kiosks, multimedia presentations, magazines, newsletters, brochures, flyers, and radio plugs.",
          "Involved in the Project's IT initiatives like software and hardware acquisitions, technical evaluation in IT procurement activities, and maintenance and troubleshooting of PC hardware."
        ],
        "accomplishments":[
          "Spearheaded the creation of a Public Information Desk for the Project."
        ],
        "keywords":[
          ""
        ]
      }
    ],
    "credentials":{
      "education":[
        {
          "degree":"Bachelor of Science in Computing",
          "major":"Computer Science",
          "year":"2011",
          "school":"Technological University of the Philippines, Manila"
        }
      ],
      "certification":[
        {
          "title":"Red Hat Certified Engineer",
          "license":"805008554934387",
          "date":"October 2008",
          "verify":{
            "link":"https://www.redhat.com/wapps/training/certification/verify.html?certNumber=805008554934387&isSearch=False&verify=Verify",
            "title":""
          }
        },
        {
          "title":"ITIL v3 Foundation in IT Service Management",
          "license":"",
          "date":"July 2008",
          "verify":{
            "link":"http://www.itil-officialsite.com/ITILEISCRSquery.aspx",
            "title":""
          }
        },
        {
          "title":"Red Hat Certified Technician",
          "license":"604006187810538",
          "date":"November 2006",
          "verify":{
            "link":"https://www.redhat.com/wapps/training/certification/verify.html?certNumber=604006187810538&isSearch=False&verify=Verify",
            "title":""
          }
        },
        {
          "title":"Microsoft Certified Professional",
          "license":"",
          "date":"May 2006",
          "verify":{
            "link":"https://mcp.microsoft.com/authenticate/validatemcp.aspx",
            "title":"Transcript ID 731041, Access Code 1aNd3x73r"
          }
        },
        {
          "title":"Trend Micro Certified Security Expert",
          "license":"",
          "date":"June 2006",
          "verify":{
            "link":"",
            "title":""
          }
        }
      ]
    },
    "references":[
      {
        "name":"Available on request.",
        "title":"",
        "organization":"",
        "contact":{
          "phone":"",
          "email":""
        }
      }
    ]
  }
}
